sysbench/test_global.log
do sysbench oltp_point_select, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 157806.41 qps: 157806.41 (r/w/o: 157806.41/0.00/0.00) lat (ms,95%): 0.54 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 166574.87 qps: 166574.87 (r/w/o: 166574.87/0.00/0.00) lat (ms,95%): 0.50 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 167945.82 qps: 167945.82 (r/w/o: 167945.82/0.00/0.00) lat (ms,95%): 0.49 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 165014.31 qps: 165014.31 (r/w/o: 165014.31/0.00/0.00) lat (ms,95%): 0.51 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 165482.00 qps: 165482.10 (r/w/o: 165482.10/0.00/0.00) lat (ms,95%): 0.50 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 159934.16 qps: 159934.06 (r/w/o: 159934.06/0.00/0.00) lat (ms,95%): 0.53 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 162804.12 qps: 162804.12 (r/w/o: 162804.12/0.00/0.00) lat (ms,95%): 0.52 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 165055.46 qps: 165055.46 (r/w/o: 165055.46/0.00/0.00) lat (ms,95%): 0.51 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 160777.93 qps: 160777.93 (r/w/o: 160777.93/0.00/0.00) lat (ms,95%): 0.53 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 161175.35 qps: 161175.35 (r/w/o: 161175.35/0.00/0.00) lat (ms,95%): 0.53 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 161689.28 qps: 161689.28 (r/w/o: 161689.28/0.00/0.00) lat (ms,95%): 0.52 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 162017.31 qps: 162017.31 (r/w/o: 162017.31/0.00/0.00) lat (ms,95%): 0.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            19563107
        write:                           0
        other:                           0
        total:                           19563107
    transactions:                        19563107 (163014.79 per sec.)
    queries:                             19563107 (163014.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0069s
    total number of events:              19563107

Latency (ms):
         min:                                    0.20
         avg:                                    0.39
         max:                                   14.59
         95th percentile:                        0.52
         sum:                              7668751.09

Threads fairness:
    events (avg/stddev):           305673.5469/1880.96
    execution time (avg/stddev):   119.8242/0.00

do sysbench oltp_point_select, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 295643.53 qps: 295643.53 (r/w/o: 295643.53/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 296547.79 qps: 296547.79 (r/w/o: 296547.79/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 290422.34 qps: 290422.34 (r/w/o: 290422.34/0.00/0.00) lat (ms,95%): 0.63 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 292353.84 qps: 292353.84 (r/w/o: 292353.84/0.00/0.00) lat (ms,95%): 0.63 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 292805.15 qps: 292805.15 (r/w/o: 292805.15/0.00/0.00) lat (ms,95%): 0.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 291669.00 qps: 291668.80 (r/w/o: 291668.80/0.00/0.00) lat (ms,95%): 0.63 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 294694.33 qps: 294694.53 (r/w/o: 294694.53/0.00/0.00) lat (ms,95%): 0.62 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 299833.22 qps: 299833.22 (r/w/o: 299833.22/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 301270.91 qps: 301270.91 (r/w/o: 301270.91/0.00/0.00) lat (ms,95%): 0.60 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 300740.20 qps: 300740.20 (r/w/o: 300740.20/0.00/0.00) lat (ms,95%): 0.60 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 302245.85 qps: 302245.85 (r/w/o: 302245.85/0.00/0.00) lat (ms,95%): 0.60 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 299964.41 qps: 299964.41 (r/w/o: 299964.41/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            35582593
        write:                           0
        other:                           0
        total:                           35582593
    transactions:                        35582593 (296485.53 per sec.)
    queries:                             35582593 (296485.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0133s
    total number of events:              35582593

Latency (ms):
         min:                                    0.19
         avg:                                    0.43
         max:                                   30.61
         95th percentile:                        0.62
         sum:                             15339860.29

Threads fairness:
    events (avg/stddev):           277989.0078/2212.28
    execution time (avg/stddev):   119.8427/0.00

do sysbench select_random_ranges, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 68936.19 qps: 68936.19 (r/w/o: 68936.19/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 69443.81 qps: 69443.81 (r/w/o: 69443.81/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 69241.04 qps: 69241.04 (r/w/o: 69241.04/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 69158.28 qps: 69158.28 (r/w/o: 69158.28/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 69157.41 qps: 69157.41 (r/w/o: 69157.41/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 68694.24 qps: 68694.24 (r/w/o: 68694.24/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 68586.08 qps: 68586.08 (r/w/o: 68586.08/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 69245.34 qps: 69245.44 (r/w/o: 69245.44/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 69308.21 qps: 69308.11 (r/w/o: 69308.11/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 68910.31 qps: 68910.31 (r/w/o: 68910.31/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 68827.92 qps: 68828.12 (r/w/o: 68828.12/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 68458.79 qps: 68458.59 (r/w/o: 68458.59/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8279876
        write:                           0
        other:                           0
        total:                           8279876
    transactions:                        8279876 (68992.46 per sec.)
    queries:                             8279876 (68992.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0100s
    total number of events:              8279876

Latency (ms):
         min:                                    0.26
         avg:                                    0.93
         max:                                   25.01
         95th percentile:                        1.73
         sum:                              7669820.97

Threads fairness:
    events (avg/stddev):           129373.0625/3168.93
    execution time (avg/stddev):   119.8410/0.00

do sysbench select_random_ranges, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 81408.72 qps: 81408.72 (r/w/o: 81408.72/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 81534.77 qps: 81534.87 (r/w/o: 81534.87/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 81946.80 qps: 81946.70 (r/w/o: 81946.70/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 81842.34 qps: 81842.34 (r/w/o: 81842.34/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 81721.52 qps: 81721.62 (r/w/o: 81721.62/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 81827.25 qps: 81827.15 (r/w/o: 81827.15/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 81370.95 qps: 81370.95 (r/w/o: 81370.95/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 82075.54 qps: 82075.54 (r/w/o: 82075.54/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 82153.83 qps: 82153.93 (r/w/o: 82153.93/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 81654.55 qps: 81654.45 (r/w/o: 81654.45/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 82207.21 qps: 82207.21 (r/w/o: 82207.21/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 81208.80 qps: 81208.80 (r/w/o: 81208.80/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            9809788
        write:                           0
        other:                           0
        total:                           9809788
    transactions:                        9809788 (81732.55 per sec.)
    queries:                             9809788 (81732.55 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0217s
    total number of events:              9809788

Latency (ms):
         min:                                    0.28
         avg:                                    1.56
         max:                                  117.14
         95th percentile:                        3.68
         sum:                             15346237.48

Threads fairness:
    events (avg/stddev):           76638.9688/2306.57
    execution time (avg/stddev):   119.8925/0.00

do sysbench oltp_update_non_index, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 18236.84 qps: 18236.84 (r/w/o: 0.00/18236.84/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 18819.32 qps: 18819.32 (r/w/o: 0.00/18819.32/0.00) lat (ms,95%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 18545.56 qps: 18545.56 (r/w/o: 0.00/18545.56/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 18480.74 qps: 18480.74 (r/w/o: 0.00/18480.74/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 18675.61 qps: 18675.61 (r/w/o: 0.00/18675.61/0.00) lat (ms,95%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 18267.03 qps: 18267.03 (r/w/o: 0.00/18267.03/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 18285.40 qps: 18285.40 (r/w/o: 0.00/18285.40/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 18363.78 qps: 18363.78 (r/w/o: 0.00/18363.78/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 18978.39 qps: 18978.39 (r/w/o: 0.00/18978.39/0.00) lat (ms,95%): 4.33 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 18459.96 qps: 18459.96 (r/w/o: 0.00/18459.96/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 18412.89 qps: 18412.89 (r/w/o: 0.00/18412.89/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 18324.00 qps: 18324.00 (r/w/o: 0.00/18324.00/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2218592
        other:                           0
        total:                           2218592
    transactions:                        2218592 (18486.80 per sec.)
    queries:                             2218592 (18486.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0082s
    total number of events:              2218592

Latency (ms):
         min:                                    1.53
         avg:                                    3.46
         max:                                   13.21
         95th percentile:                        4.49
         sum:                              7678249.19

Threads fairness:
    events (avg/stddev):           34665.5000/35.02
    execution time (avg/stddev):   119.9726/0.00

do sysbench oltp_update_non_index, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 34480.49 qps: 34480.49 (r/w/o: 0.00/34480.49/0.00) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 34491.67 qps: 34491.67 (r/w/o: 0.00/34491.67/0.00) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 35098.63 qps: 35098.63 (r/w/o: 0.00/35098.63/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 32870.24 qps: 32870.24 (r/w/o: 0.00/32870.24/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 33898.54 qps: 33898.54 (r/w/o: 0.00/33898.54/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 33751.45 qps: 33751.45 (r/w/o: 0.00/33751.45/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 34794.66 qps: 34794.66 (r/w/o: 0.00/34794.66/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 33579.35 qps: 33579.35 (r/w/o: 0.00/33579.35/0.00) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 33982.59 qps: 33982.59 (r/w/o: 0.00/33982.59/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 33791.86 qps: 33791.86 (r/w/o: 0.00/33791.86/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 34326.19 qps: 34326.19 (r/w/o: 0.00/34326.19/0.00) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 33779.29 qps: 33779.29 (r/w/o: 0.00/33779.29/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           4088631
        other:                           0
        total:                           4088631
    transactions:                        4088631 (34067.02 per sec.)
    queries:                             4088631 (34067.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0160s
    total number of events:              4088631

Latency (ms):
         min:                                    1.81
         avg:                                    3.76
         max:                                   18.87
         95th percentile:                        4.91
         sum:                             15357035.52

Threads fairness:
    events (avg/stddev):           31942.4297/41.54
    execution time (avg/stddev):   119.9768/0.00

do sysbench oltp_update_index, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 17585.33 qps: 17585.33 (r/w/o: 0.00/17585.33/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 17116.77 qps: 17116.77 (r/w/o: 0.00/17116.77/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 17275.92 qps: 17275.92 (r/w/o: 0.00/17275.92/0.00) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 17445.60 qps: 17445.60 (r/w/o: 0.00/17445.60/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 18126.58 qps: 18126.58 (r/w/o: 0.00/18126.58/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 17642.31 qps: 17642.31 (r/w/o: 0.00/17642.31/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 17124.90 qps: 17124.90 (r/w/o: 0.00/17124.90/0.00) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 17437.41 qps: 17437.41 (r/w/o: 0.00/17437.41/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 18124.51 qps: 18124.51 (r/w/o: 0.00/18124.51/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 18131.56 qps: 18131.56 (r/w/o: 0.00/18131.56/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 17998.41 qps: 17998.41 (r/w/o: 0.00/17998.41/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 18408.23 qps: 18408.23 (r/w/o: 0.00/18408.23/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2124259
        other:                           0
        total:                           2124259
    transactions:                        2124259 (17700.73 per sec.)
    queries:                             2124259 (17700.73 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0084s
    total number of events:              2124259

Latency (ms):
         min:                                    1.69
         avg:                                    3.61
         max:                                   23.82
         95th percentile:                        4.65
         sum:                              7678114.09

Threads fairness:
    events (avg/stddev):           33191.5469/34.97
    execution time (avg/stddev):   119.9705/0.00

do sysbench oltp_update_index, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 29952.60 qps: 29952.60 (r/w/o: 0.00/29952.60/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 29632.17 qps: 29632.17 (r/w/o: 0.00/29632.17/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 31377.27 qps: 31377.27 (r/w/o: 0.00/31377.27/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 30705.72 qps: 30705.72 (r/w/o: 0.00/30705.72/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 29589.36 qps: 29589.36 (r/w/o: 0.00/29589.36/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 32425.95 qps: 32425.95 (r/w/o: 0.00/32425.95/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 33136.82 qps: 33136.82 (r/w/o: 0.00/33136.82/0.00) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 33693.71 qps: 33693.71 (r/w/o: 0.00/33693.71/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 33907.70 qps: 33907.70 (r/w/o: 0.00/33907.70/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 33126.51 qps: 33126.51 (r/w/o: 0.00/33126.51/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 32068.73 qps: 32068.73 (r/w/o: 0.00/32068.73/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 33748.76 qps: 33748.76 (r/w/o: 0.00/33748.76/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           3833841
        other:                           0
        total:                           3833841
    transactions:                        3833841 (31944.31 per sec.)
    queries:                             3833841 (31944.31 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0151s
    total number of events:              3833841

Latency (ms):
         min:                                    1.92
         avg:                                    4.01
         max:                                  119.43
         95th percentile:                        5.28
         sum:                             15356682.18

Threads fairness:
    events (avg/stddev):           29951.8828/35.39
    execution time (avg/stddev):   119.9741/0.00

do sysbench oltp_insert, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 15569.88 qps: 15569.88 (r/w/o: 0.00/15569.88/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 17645.94 qps: 17645.94 (r/w/o: 0.00/17645.94/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 17579.26 qps: 17579.26 (r/w/o: 0.00/17579.26/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 17642.75 qps: 17642.75 (r/w/o: 0.00/17642.75/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 17618.55 qps: 17618.55 (r/w/o: 0.00/17618.55/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 17345.03 qps: 17345.03 (r/w/o: 0.00/17345.03/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 17279.06 qps: 17279.06 (r/w/o: 0.00/17279.06/0.00) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 17654.14 qps: 17654.14 (r/w/o: 0.00/17654.14/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 17707.57 qps: 17707.57 (r/w/o: 0.00/17707.57/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 17525.39 qps: 17525.39 (r/w/o: 0.00/17525.39/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 17431.33 qps: 17431.33 (r/w/o: 0.00/17431.33/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 17395.37 qps: 17395.37 (r/w/o: 0.00/17395.37/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2084035
        other:                           0
        total:                           2084035
    transactions:                        2084035 (17365.37 per sec.)
    queries:                             2084035 (17365.37 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0097s
    total number of events:              2084035

Latency (ms):
         min:                                    1.71
         avg:                                    3.68
         max:                                   43.50
         95th percentile:                        4.82
         sum:                              7672177.81

Threads fairness:
    events (avg/stddev):           32563.0469/38.52
    execution time (avg/stddev):   119.8778/0.00

do sysbench oltp_insert, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 30832.30 qps: 30832.30 (r/w/o: 0.00/30832.30/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 29705.06 qps: 29705.06 (r/w/o: 0.00/29705.06/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 32459.53 qps: 32459.53 (r/w/o: 0.00/32459.53/0.00) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 31855.66 qps: 31855.66 (r/w/o: 0.00/31855.66/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 31590.13 qps: 31590.13 (r/w/o: 0.00/31590.13/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 31781.86 qps: 31781.86 (r/w/o: 0.00/31781.86/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 32188.99 qps: 32188.99 (r/w/o: 0.00/32188.99/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 32640.96 qps: 32640.96 (r/w/o: 0.00/32640.96/0.00) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 31329.68 qps: 31329.68 (r/w/o: 0.00/31329.68/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 29852.89 qps: 29852.89 (r/w/o: 0.00/29852.89/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 31711.40 qps: 31711.40 (r/w/o: 0.00/31711.40/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 32092.08 qps: 32092.08 (r/w/o: 0.00/32092.08/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           3780574
        other:                           0
        total:                           3780574
    transactions:                        3780574 (31499.74 per sec.)
    queries:                             3780574 (31499.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0179s
    total number of events:              3780574

Latency (ms):
         min:                                    1.70
         avg:                                    4.06
         max:                                   59.22
         95th percentile:                        5.28
         sum:                             15345404.72

Threads fairness:
    events (avg/stddev):           29535.7344/39.03
    execution time (avg/stddev):   119.8860/0.00